ARMmbed/mbed-os/targets/TARGET_Geehy/TARGET_APM32F4XX/APM32F4xx_StdPeriphDriver/src/apm32f4xx_usb_host.c
                    /* reactivate the host channel */
                    usbhh->usbHost->REGS_HCH[channelNum].HCH_B.CHINT = BIT_RESET;
                    usbhh->usbHost->REGS_HCH[channelNum].HCH_B.CHEN = BIT_SET;
                }
                break;

            case PIPE_NAK:
                usbhh->xferPipe[channelNum].urbStatus = USB_URB_NOREADY;

                /* reactivate the host channel */
                usbhh->usbHost->REGS_HCH[channelNum].HCH_B.CHINT = BIT_RESET;
                usbhh->usbHost->REGS_HCH[channelNum].HCH_B.CHEN = BIT_SET;
                break;

            case PIPE_BBLERR:
                usbhh->xferPipe[channelNum].errorCnt++;
                usbhh->xferPipe[channelNum].urbStatus = USB_URB_ERROR;
                break;

            default:
                break;
        }

        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TSFCMPAN);

        /* USB update URB status callback */
        USBH_UpdateUrbCallback(usbhh);
    }
    /* NAK Response Received */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXNAK))
    {
        switch (usbhh->xferPipe[channelNum].epType)
        {
            case EP_TYPE_CONTROL:
            case EP_TYPE_BULK:
                usbhh->xferPipe[channelNum].errorCnt = 0;

                if (usbhh->usbCfg.dmaStatus == DISABLE)
                {
                    usbhh->xferPipe[channelNum].pipeState = PIPE_NAK;
                    USB_OTG_H_HaltChannel(usbhh, channelNum);
                }
                break;

            case EP_TYPE_INTERRUPT:
                usbhh->xferPipe[channelNum].errorCnt = 0;
                USB_OTG_H_HaltChannel(usbhh, channelNum);
                break;

            default:
                break;
        }

        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXNAK);
    }
    else
    {

    }
}

/*!
 * @brief       Handle Host port out interrupt
 *
 * @param       usbhh: USB host handler.
 *
 * @param       channelNum : Select channel.
 *
 * @retval      None
 */
static void USBH_OUT_HostChannelIsrHandler(USBH_HANDLE_T* usbhh, uint8_t channelNum)
{
    /* AHB Error only in HS mode*/
    if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_AHBERR))
    {
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_AHBERR);
        USB_OTG_H_HaltChannel(usbhh, channelNum);

        usbhh->xferPipe[channelNum].pipeState = PIPE_XACTERR;
    }
    /* ACK Response Received/Transmitted */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXTXACK))
    {
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXTXACK);

        if (usbhh->xferPipe[channelNum].pingStatus == ENABLE)
        {
            usbhh->xferPipe[channelNum].pingStatus = DISABLE;
            usbhh->xferPipe[channelNum].urbStatus = USB_URB_NOREADY;
            USB_OTG_H_HaltChannel(usbhh, channelNum);
        }
    }
    /* Frame Overrun Error */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_FOVR))
    {
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_FOVR);
        USB_OTG_H_HaltChannel(usbhh, channelNum);
    }
    /* Transfer Complete Normally */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TSFCMPN))
    {
        usbhh->xferPipe[channelNum].errorCnt = 0;

        /* Update ping status */
        if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXNYET))
        {
            usbhh->xferPipe[channelNum].pingStatus = ENABLE;
            USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXNYET);
        }

        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TSFCMPN);
        usbhh->xferPipe[channelNum].pipeState = PIPE_XFRC;
        USB_OTG_H_HaltChannel(usbhh, channelNum);
    }
    /* NYET Response Received */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXNYET))
    {
        usbhh->xferPipe[channelNum].pingStatus = ENABLE;
        usbhh->xferPipe[channelNum].errorCnt = 0;
        usbhh->xferPipe[channelNum].pipeState = PIPE_NYET;
        USB_OTG_H_HaltChannel(usbhh, channelNum);
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXNYET);
    }
    /* STALL Response Received */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXSTALL))
    {
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXSTALL);

        usbhh->xferPipe[channelNum].pipeState = PIPE_STALL;
        USB_OTG_H_HaltChannel(usbhh, channelNum);
    }
    /* NAK Response Received */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXNAK))
    {
        usbhh->xferPipe[channelNum].errorCnt = 0;
        usbhh->xferPipe[channelNum].pipeState = PIPE_NAK;

        if (usbhh->xferPipe[channelNum].pingStatus == DISABLE)
        {
            if (usbhh->xferPipe[channelNum].speed == USBH_DEV_SPEED_HIGH)
            {
                usbhh->xferPipe[channelNum].pingStatus = ENABLE;
            }
        }

        USB_OTG_H_HaltChannel(usbhh, channelNum);
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXNAK);
    }
    /* Transaction Error */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TERR))
    {
        if (usbhh->usbCfg.dmaStatus == DISABLE)
        {
            usbhh->xferPipe[channelNum].pipeState = PIPE_XACTERR;
            USB_OTG_H_HaltChannel(usbhh, channelNum);
        }
        else
        {
            usbhh->xferPipe[channelNum].errorCnt++;
            if (usbhh->xferPipe[channelNum].errorCnt >= 2)
            {
                usbhh->xferPipe[channelNum].errorCnt = 0;
                usbhh->xferPipe[channelNum].urbStatus = USB_URB_ERROR;

                /* USB update URB status callback */
                USBH_UpdateUrbCallback(usbhh);
            }
            else
            {
                usbhh->xferPipe[channelNum].urbStatus = USB_URB_NOREADY;
            }
        }
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TERR);
    }
    /* Data Toggle Error */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_DTOG))
    {
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_DTOG);
        USB_OTG_H_HaltChannel(usbhh, channelNum);

        usbhh->xferPipe[channelNum].pipeState = PIPE_DATATGLERR;
    }
    /* Transfer Complete Abnormally */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TSFCMPAN))
    {
        switch (usbhh->xferPipe[channelNum].pipeState)
        {
            case PIPE_XFRC:
                usbhh->xferPipe[channelNum].urbStatus = USB_URB_OK;
                if ((usbhh->xferPipe[channelNum].epType == EP_TYPE_BULK) || \
                        (usbhh->xferPipe[channelNum].epType == EP_TYPE_INTERRUPT))
                {
                    if (usbhh->usbCfg.dmaStatus == DISABLE)
                    {
                        usbhh->xferPipe[channelNum].pidToggleOut ^= 1;
                    }

                    if ((usbhh->usbCfg.dmaStatus == ENABLE) && \
                            (usbhh->xferPipe[channelNum].bufLen > 0))
                    {
                        if ((((usbhh->xferPipe[channelNum].bufLen + \
                                usbhh->xferPipe[channelNum].maxPackSize - 1) /
                                usbhh->xferPipe[channelNum].maxPackSize) & 0x01) != 0)
                        {
                            usbhh->xferPipe[channelNum].pidToggleOut ^= 1;
                        }
                    }
                }
                break;

