ARMmbed/mbed-os/targets/TARGET_Geehy/TARGET_APM32F4XX/APM32F4xx_StdPeriphDriver/src/apm32f4xx_usb_host.c
        /* Incomplete Isochronous IN Transfer Interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_IIINTX))
        {
            /* Clear interrupt */
            USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_IIINTX);
        }

        /* Periodic TXFIFO Empty Interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_PTXFE))
        {
            /* Clear interrupt */
            USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_PTXFE);
        }

        /* Mode Mismatch Interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_MMIS))
        {
            /* Clear interrupt */
            USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_MMIS);
        }

        /* Handle Disconnect detected interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_DEDIS))
        {
            USBH_DisconnectIsrHandler(usbhh);
        }

        /* Handle Host Port Interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_HPORT))
        {
            USBH_HostPortIsrHandler(usbhh);
        }

        /* Start of Frame Interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_SOF))
        {
            USBH_SOFCallback(usbhh);
            /* Clear interrupt */
            USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_SOF);
        }

        /* Handle RxFIFO no empty interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_RXFNONE))
        {
            USBH_RxFifoNoEmptyIsrHandler(usbhh);
        }

        /* Handle Host channels interrupt */
        if (USB_OTG_ReadGlobalIntFlag(usbhh->usbGlobal, USB_INT_G_HCHAN))
        {
            USBH_HostChannelsIsrHandler(usbhh);
        }
    }
}

/*!
 * @brief     USB host start
 *
 * @param     usbhh: USB host handler
 *
 * @retval    None
 */
void USBH_Start(USBH_HANDLE_T* usbhh)
{
    /* Enable USB OTG port power */
    USB_OTG_H_DriverVbus(usbhh->usbHost, USBH_PORT_PWR_ON);

    /* Enable USB OTG all global interrupt */
    USB_OTG_EnableAllGlobalInterrupt(usbhh->usbGlobal);
}

/*!
 * @brief     USB OTG host reset
 *
 * @param     usbhh: USB host handler
 *
 * @retval    None
 */
void USBH_OTG_ResetHost(USBH_HANDLE_T* usbhh)
{
    usbhh->usbHost->HPORTCSTS_B.PRST = BIT_SET;

    /* This bit need to keep more than 10 ms */
    delay_t(100);
    usbhh->usbHost->HPORTCSTS_B.PRST = BIT_RESET;
    delay_t(10);
}

/*!
 * @brief     USB OTG host read speed
 *
 * @param     usbhh: USB host handler
 *
 * @retval    speed
 */
uint8_t USBH_OTG_ReadSpeed(USBH_HANDLE_T* usbhh)
{
    return (usbhh->usbHost->HPORTCSTS_B.PSPDSEL);
}

/*!
 * @brief     USB OTG host read URB status
 *
 * @param     usbhh: USB host handler
 *
 * @param     channelNum: channel number
 *
 * @retval    URB status
 */
USB_OTG_URB_STA_T USBH_OTG_ReadUrbStatus(USBH_HANDLE_T* usbhh, uint8_t channelNum)
{
    return usbhh->xferPipe[channelNum].urbStatus;
}

/*!
 * @brief     USB OTG stop host port
 *
 * @param     usbhh: USB host handler
 *
 * @retval    None
 */
void USBH_OTG_StopHost(USBH_HANDLE_T* usbhh)
{
    uint8_t i;
    uint32_t timeout = 0;
    uint8_t regNum = 0;

    USB_OTG_DisableAllGlobalInterrupt(usbhh->usbGlobal);

    /* Flush all Tx and Rx FIFOs */
    USB_OTG_FlushTxFIFO(usbhh->usbGlobal, 0x10);
    USB_OTG_FlushRxFIFO(usbhh->usbGlobal);

    if(usbhh->usbCfg.speed == USB_OTG_SPEED_FSLS)
    {
        regNum = 8;
    }
    else
    {
        regNum = 12;
    }
    
    /* Flush out any leftover queued requests */
    for (i = 0; i < regNum; i++)
    {
        usbhh->usbHost->REGS_HCH[i].HCH_B.CHINT     = BIT_SET;
        usbhh->usbHost->REGS_HCH[i].HCH_B.CHEN      = BIT_RESET;
        usbhh->usbHost->REGS_HCH[i].HCH_B.EDPDRT    = BIT_RESET;
    }

    /* Halt all channels and put them into a known state */
    for (i = 0; i < regNum; i++)
    {
        usbhh->usbHost->REGS_HCH[i].HCH_B.CHINT     = BIT_SET;
        usbhh->usbHost->REGS_HCH[i].HCH_B.CHEN      = BIT_SET;
        usbhh->usbHost->REGS_HCH[i].HCH_B.EDPDRT    = BIT_RESET;

        while (usbhh->usbHost->REGS_HCH[i].HCH_B.CHEN)
        {
            timeout++;

            if (timeout >= 0x400)
            {
                break;
            }
        }
    }

    USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, 0xFFFFFFFF);

    USB_OTG_EnableAllGlobalInterrupt(usbhh->usbGlobal);
}

/*!
 * @brief     USB host close the channel
 *
 * @param     usbhh : usb host handler
 *
 * @param     channelNum : channel numer
 *
 * @retval    None
 */
void USBH_CloseChannel(USBH_HANDLE_T* usbhh, uint8_t channelNum)
{
    USB_OTG_H_HaltChannel(usbhh, channelNum);
}

/*!
 * @brief     USB host reset
 *
 * @param     usbhh : usb host handler
 *
 * @retval    None
 */
void USBH_Reset(USBH_HANDLE_T* usbhh)
{
    USBH_HardwareResetCallback(usbhh);

    USB_OTG_DisableAllGlobalInterrupt(usbhh->usbGlobal);
}

/*!
 * @brief     USB host open the channel to transfer
 *
 * @param     usbhh : usb host handler
 *
 * @param     channelNum : channel numer
 *
 * @param     endPointNum : end point number
 *
 * @param     devAddr : USB device address
 *
 * @param     devSpeed : USB device speed
 *
 * @param     epType : end point type
 *
 * @param     packetMaxSize : max size of packet
 *
 * @retval    None
 */
void USBH_OTG_OpenChannel(USBH_HANDLE_T* usbhh, uint8_t channelNum, \
                          uint8_t endPointNum, uint8_t devAddr, \
                          uint8_t devSpeed, uint8_t epType, uint16_t packetMaxSize)
{
    /* Store usb host handler */
    usbhh->xferPipe[channelNum].pingStatus  = DISABLE;
    usbhh->xferPipe[channelNum].devAddr     = devAddr;
    usbhh->xferPipe[channelNum].maxPackSize = packetMaxSize;
    usbhh->xferPipe[channelNum].chNum       = channelNum;
    usbhh->xferPipe[channelNum].epType      = epType;
    usbhh->xferPipe[channelNum].epNum       = endPointNum & 0x7F;
    usbhh->xferPipe[channelNum].speed       = devSpeed;

    /* End point direction is IN*/
    if ((endPointNum & 0x80) == 0x80)
    {
        usbhh->xferPipe[channelNum].epDir = EP_DIR_IN;
    }
    else
    {
        usbhh->xferPipe[channelNum].epDir = EP_DIR_OUT;
    }

    /* Init usb host channel */
    /* Clear old interrupt for host channel */
    usbhh->usbHost->REGS_HCH[channelNum].HCHINT = 0xFFFFFFFF;

    /* Enable channel interrupt */
    if ((epType == EP_TYPE_CONTROL) || (epType == EP_TYPE_BULK))
    {
        usbhh->usbHost->REGS_HCH[channelNum].HCHIMASK = (CHANNEL_INT_TSFCMPN |
                CHANNEL_INT_AHBERR  |
                CHANNEL_INT_RXSTALL |
                CHANNEL_INT_TERR    |
                CHANNEL_INT_RXNAK   |
                CHANNEL_INT_DTOG);

        /* EP dir IN */
        if ((endPointNum & 0x80) == 0x80)
        {
            usbhh->usbHost->REGS_HCH[channelNum].HCHIMASK |= CHANNEL_INT_BABBLE;
        }
        else
        {
            /* Add CID judge */
        }
    }
    else if (epType == EP_TYPE_INTERRUPT)
    {
        usbhh->usbHost->REGS_HCH[channelNum].HCHIMASK = (CHANNEL_INT_TSFCMPN |
                CHANNEL_INT_AHBERR  |
                CHANNEL_INT_RXSTALL |
                CHANNEL_INT_TERR    |
                CHANNEL_INT_RXNAK   |
                CHANNEL_INT_FOVR    |
                CHANNEL_INT_DTOG);

        /* EP dir IN */
        if ((endPointNum & 0x80) == 0x80)
        {
            usbhh->usbHost->REGS_HCH[channelNum].HCHIMASK |= CHANNEL_INT_BABBLE;
        }
    }
    else if (epType == EP_TYPE_ISO)
    {
        usbhh->usbHost->REGS_HCH[channelNum].HCHIMASK = (CHANNEL_INT_TSFCMPN |
                CHANNEL_INT_AHBERR  |
                CHANNEL_INT_RXTXACK |
                CHANNEL_INT_FOVR);

        /* EP dir IN */
        if ((endPointNum & 0x80) == 0x80)
        {
            usbhh->usbHost->REGS_HCH[channelNum].HCHIMASK |= (CHANNEL_INT_BABBLE | CHANNEL_INT_TERR);
        }
    }
    else
    {

